; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	spectrograph1 - mode
	spectrograph0 - mode
	GroundStation2 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation10 - direction
	GroundStation12 - direction
	Star0 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation1 - direction
	GroundStation13 - direction
	Star11 - direction
	GroundStation14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Star19 - direction
	Star20 - direction
	Phenomenon21 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 Star11)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon17)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation12)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation14)
	(calibration_target instrument4 Star11)
	(calibration_target instrument4 GroundStation13)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation6)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation5)
)
(:goal (and
	(pointing satellite2 Star18)
	(have_image Phenomenon15 spectrograph0)
	(have_image Phenomenon16 spectrograph1)
	(have_image Star18 spectrograph0)
	(have_image Star20 spectrograph0)
	(have_image Phenomenon21 spectrograph0)
))

)

; plan
1. (turn_to satellite2 groundstation1 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 6
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 6
3. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 0 of 6
4. (turn_to satellite2 phenomenon21 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon21)
   goals met: 0 of 6
5. (take_image satellite2 phenomenon21 instrument4 spectrograph0)
   added: (have_image phenomenon21 spectrograph0)
   goals met: 1 of 6
6. (turn_to satellite2 phenomenon16 phenomenon21)
   deleted: (pointing satellite2 phenomenon21)
   added: (pointing satellite2 phenomenon16)
   goals met: 1 of 6
7. (take_image satellite2 phenomenon16 instrument4 spectrograph1)
   added: (have_image phenomenon16 spectrograph1)
   goals met: 2 of 6
8. (turn_to satellite2 phenomenon15 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon15)
   goals met: 2 of 6
9. (take_image satellite2 phenomenon15 instrument4 spectrograph0)
   added: (have_image phenomenon15 spectrograph0)
   goals met: 3 of 6
10. (turn_to satellite2 star20 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 star20)
   goals met: 3 of 6
11. (take_image satellite2 star20 instrument4 spectrograph0)
   added: (have_image star20 spectrograph0)
   goals met: 4 of 6
12. (turn_to satellite2 star18 star20)
   deleted: (pointing satellite2 star20)
   added: (pointing satellite2 star18)
   goals met: 5 of 6
13. (take_image satellite2 star18 instrument4 spectrograph0)
   added: (have_image star18 spectrograph0)
   goals met: 6 of 6
